//
//  Game.c
//  MyWorldDemo
//
//  Created by apple on 2017/6/4.
//  Copyright © 2017年 apple. All rights reserved.
//

#include "Game.h"

/*
 int id;//道具编号
 char name[50];//道具名称
 int level;//道具级别
 int stock;//道具商店库存或背包中的叠加数
 double price; //道具的价格
 PropType type;//道具类型
 union{  //联合：多选1
 int minAttack;  //武器对应攻击力
 int minDefence; //防具对应防御力
 int minPower;   //消耗品对应增加的能量值
 int maxAttack;
 int maxDefence;
 int maxPower;
 };
 char desc[200];//道具的功能描述
 */
/*游戏道具类型枚举 - 武器、防具、消耗品、卡片、碎片
 *Weapon,Armor,Con,Card,Frag
 */


Prop propArray[]={
    {1,"抵杭天烈剑",1,5,5000,Weapon,.minAttack=1,.maxAttack=4,"三皇五帝用过的剑"},
    {2,"荆棘之甲",2,5,10000,Armor,.minDefence=2,.maxDefence=6,"反弹伤害"},
    {3,"玉液琼浆",3,5,15000,Con,.minPower=100,.maxPower=500,"御用饮品"}
};


/*
 int id;         //地图编号
 char name[50];  //地图名称
 int minLevel;   //玩家进入的最小等级
 //坐标结构
 //COORD coord;    //地图坐标（x,y）     windows默认的坐标结构--------------#include <windows.h>
 char desc[500]; //地图介绍
 */

//8*8行列
Map mapArray[8][8]={
    {
        {1,"天山",1,{0,0},"这里充满了西域文化"},{1,"天山",1,{0,0},"这里充满了西域文化"},
        {1,"天山",1,{0,0},"这里充满了西域文化"},{1,"天山",1,{0,0},"这里充满了西域文化"},
        {1,"天山",1,{0,0},"这里充满了西域文化"},{1,"天山",1,{0,0},"这里充满了西域文化"},
        {1,"天山",1,{0,0},"这里充满了西域文化"},{1,"天山",1,{0,0},"这里充满了西域文化"}
    },
    {
        {1,"天山",1,{0,0},"这里充满了西域文化"},{1,"天山",1,{0,0},"这里充满了西域文化"},
        {1,"天山",1,{0,0},"这里充满了西域文化"},{1,"天山",1,{0,0},"这里充满了西域文化"},
        {1,"天山",1,{0,0},"这里充满了西域文化"},{1,"天山",1,{0,0},"这里充满了西域文化"},
        {1,"天山",1,{0,0},"这里充满了西域文化"},{1,"天山",1,{0,0},"这里充满了西域文化"}
    },
    {
        {1,"天山",1,{0,0},"这里充满了西域文化"},{1,"天山",1,{0,0},"这里充满了西域文化"},
        {1,"天山",1,{0,0},"这里充满了西域文化"},{1,"天山",1,{0,0},"这里充满了西域文化"},
        {1,"天山",1,{0,0},"这里充满了西域文化"},{1,"天山",1,{0,0},"这里充满了西域文化"},
        {1,"天山",1,{0,0},"这里充满了西域文化"},{1,"天山",1,{0,0},"这里充满了西域文化"}
    },
    {
        {1,"天山",1,{0,0},"这里充满了西域文化"},{1,"天山",1,{0,0},"这里充满了西域文化"},
        {1,"天山",1,{0,0},"这里充满了西域文化"},{1,"天山",1,{0,0},"这里充满了西域文化"},
        {1,"天山",1,{0,0},"这里充满了西域文化"},{1,"天山",1,{0,0},"这里充满了西域文化"},
        {1,"天山",1,{0,0},"这里充满了西域文化"},{1,"天山",1,{0,0},"这里充满了西域文化"}
    },
    {
        {1,"天山",1,{0,0},"这里充满了西域文化"},{1,"天山",1,{0,0},"这里充满了西域文化"},
        {1,"天山",1,{0,0},"这里充满了西域文化"},{1,"天山",1,{0,0},"这里充满了西域文化"},
        {1,"天山",1,{0,0},"这里充满了西域文化"},{1,"天山",1,{0,0},"这里充满了西域文化"},
        {1,"天山",1,{0,0},"这里充满了西域文化"},{1,"天山",1,{0,0},"这里充满了西域文化"}
    },
    {
        {1,"天山",1,{0,0},"这里充满了西域文化"},{1,"天山",1,{0,0},"这里充满了西域文化"},
        {1,"天山",1,{0,0},"这里充满了西域文化"},{1,"天山",1,{0,0},"这里充满了西域文化"},
        {1,"天山",1,{0,0},"这里充满了西域文化"},{1,"天山",1,{0,0},"这里充满了西域文化"},
        {1,"天山",1,{0,0},"这里充满了西域文化"},{1,"天山",1,{0,0},"这里充满了西域文化"}
    },
    {
        {1,"天山",1,{0,0},"这里充满了西域文化"},{1,"天山",1,{0,0},"这里充满了西域文化"},
        {1,"天山",1,{0,0},"这里充满了西域文化"},{1,"天山",1,{0,0},"这里充满了西域文化"},
        {1,"天山",1,{0,0},"这里充满了西域文化"},{1,"天山",1,{0,0},"这里充满了西域文化"},
        {1,"天山",1,{0,0},"这里充满了西域文化"},{1,"天山",1,{0,0},"这里充满了西域文化"}
    },
    {
        {1,"天山",1,{0,0},"这里充满了西域文化"},{1,"天山",1,{0,0},"这里充满了西域文化"},
        {1,"天山",1,{0,0},"这里充满了西域文化"},{1,"天山",1,{0,0},"这里充满了西域文化"},
        {1,"天山",1,{0,0},"这里充满了西域文化"},{1,"天山",1,{0,0},"这里充满了西域文化"},
        {1,"天山",1,{0,0},"这里充满了西域文化"},{1,"天山",1,{0,0},"这里充满了西域文化"}
    }
};

void Init()//初始化函数
{
    
}


void Show()//显示数据
{
    int i;
    int propCount = sizeof(propArray)/sizeof(Prop);
    printf("%-15s\t%-15s\t道具价格\t道具功能范围\n","道具编号","道具名称");
    for (i=0; i<propCount; i++) {
        printf("%-10d\t%-15s\t%.0lf\t",propArray[i].id,propArray[i].name,propArray[i].price);
        switch (propArray[i].type) {
            case Weapon:
                printf("最小攻击力：%d\t最大攻击力：%d\n",propArray[i].minAttack,propArray[i].maxAttack);
                break;
            case Armor:
                printf("最小防御力：%d\t最大防御力：%d\n",propArray[i].minDefence,propArray[i].maxDefence);
                break;
            case Con:
                printf("最小的增加能量值：%d\t最大的增加能量值：%d\n",propArray[i].minDefence,propArray[i].maxDefence);
                break;
            default:
                break;
        }
    }
}


